In [1]:
import pandas as pd

In [2]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ai nexut it\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ai nexut it\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ai nexut it\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [3]:
from sqlalchemy import create_engine

In [5]:
conn = create_engine("mysql+pymysql://root:root@localhost:3306/online78")

In [6]:
conn

Engine(mysql+pymysql://root:***@localhost:3306/online78)

In [9]:
df = pd.read_sql_query("select * from emp where city='pune'",conn)

In [10]:
df

    id  name  city
0  103  Amit  pune

In [11]:
df = pd.read_sql_table("emp",conn)

In [12]:
df

        id             name            city
0      101           keshav        new pune
1      102            Rahul          Mumbai
2      103             Amit         Chennai
3      103             Amit            pune
4        1     Martin Silva     Lake Robert
...    ...              ...             ...
998    996  Kimberly Maddox  Elizabethburgh
999    997   Tammy Anderson      Bobbyville
1000   998  Courtney Powell     Kristinside
1001   999   Adam Gutierrez        Kevinton
1002  1000      Tina Miller  Websterborough

[1003 rows x 3 columns]

In [13]:
#read -- Data From DB using Pandas

In [14]:
df = pd.read_html("COVID-19 pandemic by country and territory - Wikipedia.html")

In [18]:
df = df[12]

In [19]:
df

,Unnamed: 0,Country,Deaths / million,Deaths,Cases
0,NaN,World[a],892,7101788,778652552
1,NaN,Peru,6603,221060,4532724
2,NaN,Bulgaria,5679,38767,1339355
3,NaN,North Macedonia,5429,9991,352093
4,NaN,Bosnia and Herzegovina,5119,16406,404289
...,...,...,...,...,...
235,NaN,Pitcairn Islands,0,0,4
236,NaN,Tokelau,0,0,80
237,NaN,North Korea,0,0,0
238,NaN,Turkmenistan,0,0,0
239,^ Countries which do not report data for a col...,^ Countries which do not report data for a col...,^ Countries which do not report data for a col...,^ Countries which do not report data for a col...,^ Countries which do not report data for a col...

In [20]:
df.to_sql(name="coviddata",
          con=conn,
         if_exists="append")

240

In [ ]:
table --> append
replace 

fail

In [106]:
df = pd.read_csv("employee_records.csv")

In [32]:
df.to_sql(name="emprecords1",
          con=conn,
          if_exists="replace",
          index=False
         )

100

In [ ]:
SQLALchemy :
Pandas to Database:
=====================

In [34]:
df.shape

(100, 4)

In [ ]:
2. DataFrame Attributes
df.shape – Get the number of rows and columns (shape).
df.columns – Get the column labels.
df.index – Get the index of the DataFrame.
df.dtypes – Get the data types of columns.
df.size – Get the total number of elements in the DataFrame.
df.ndim – Get the number of dimensions.
df.memory_usage() – Get the memory usage of the DataFrame.
df.describe() – Get summary statistics of the DataFrame.
df.info() – Get concise summary of the DataFrame.

In [35]:
df.shape

(100, 4)

In [36]:
df.dtypes

eid          int64
ename       object
eemailid    object
city        object
dtype: object

In [ ]:
pandas -- object -- str

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   eid       100 non-null    int64
 1   ename     100 non-null    object
 2   eemailid  100 non-null    object
 3   city      100 non-null    object
dtypes: int64(1), object(3)
memory usage: 3.3+ KB

In [38]:
df.describe()

              eid
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [ ]:
EDA --> 

Distrubution

In [39]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [40]:
df.size

400

In [41]:
df.ndim

2

In [42]:
df.memory_usage()

Index       132
eid         800
ename       800
eemailid    800
city        800
dtype: int64

In [43]:
#How to select single col

In [44]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [46]:
df['ename']

0           Tamara House
1       Patricia Stevens
2            Victor Ryan
3            David Glass
4         Lori Contreras
             ...
95            Jill Tapia
96          Alexis Smith
97           Terry Cohen
98    Christopher Berger
99          Wendy Turner
Name: ename, Length: 100, dtype: object

In [48]:
df['cityasfsdaf']

KeyError: 'cityasfsdaf'

In [51]:
df.get("city1","no col present")

'no col present'

In [52]:
df['city']

0             Whitestad
1         East Veronica
2        Gutierrezmouth
3      East Kristenstad
4        North Luisside
            ...
95         South Vernon
96          Millerburgh
97           Meghanside
98    West Lorrainefurt
99         West Jeffrey
Name: city, Length: 100, dtype: object

In [ ]:
df[[col,col1,col2]]

In [53]:
df[['eid','city']]

    eid               city
0     1          Whitestad
1     2      East Veronica
2     3     Gutierrezmouth
3     4   East Kristenstad
4     5     North Luisside
..  ...                ...
95   96       South Vernon
96   97        Millerburgh
97   98         Meghanside
98   99  West Lorrainefurt
99  100       West Jeffrey

[100 rows x 2 columns]

In [ ]:
250 cols --> 


Brokers 

Clients

users

b_name,b_id,b_city

c_name,c_city,c_address

In [54]:
df = pd.read_csv("creditcard.csv")

In [55]:
df

,Time,V1,V2,V3,V4,V5,V6,V7,V8,V9,...,V21,V22,V23,V24,V25,V26,V27,V28,Amount,Class
0,0.0,-1.359807,-0.072781,2.536347,1.378155,-0.338321,0.462388,0.239599,0.098698,0.363787,...,-0.018307,0.277838,-0.110474,0.066928,0.128539,-0.189115,0.133558,-0.021053,149.62,0
1,0.0,1.191857,0.266151,0.166480,0.448154,0.060018,-0.082361,-0.078803,0.085102,-0.255425,...,-0.225775,-0.638672,0.101288,-0.339846,0.167170,0.125895,-0.008983,0.014724,2.69,0
2,1.0,-1.358354,-1.340163,1.773209,0.379780,-0.503198,1.800499,0.791461,0.247676,-1.514654,...,0.247998,0.771679,0.909412,-0.689281,-0.327642,-0.139097,-0.055353,-0.059752,378.66,0
3,1.0,-0.966272,-0.185226,1.792993,-0.863291,-0.010309,1.247203,0.237609,0.377436,-1.387024,...,-0.108300,0.005274,-0.190321,-1.175575,0.647376,-0.221929,0.062723,0.061458,123.50,0
4,2.0,-1.158233,0.877737,1.548718,0.403034,-0.407193,0.095921,0.592941,-0.270533,0.817739,...,-0.009431,0.798278,-0.137458,0.141267,-0.206010,0.502292,0.219422,0.215153,69.99,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284802,172786.0,-11.881118,10.071785,-9.834783,-2.066656,-5.364473,-2.606837,-4.918215,7.305334,1.914428,...,0.213454,0.111864,1.014480,-0.509348,1.436807,0.250034,0.943651,0.823731,0.77,0
284803,172787.0,-0.732789,-0.055080,2.035030,-0.738589,0.868229,1.058415,0.024330,0.294869,0.584800,...,0.214205,0.924384,0.012463,-1.016226,-0.606624,-0.395255,0.068472,-0.053527,24.79,0
284804,172788.0,1.919565,-0.301254,-3.249640,-0.557828,2.630515,3.031260,-0.296827,0.708417,0.432454,...,0.232045,0.578229,-0.037501,0.640134,0.265745,-0.087371,0.004455,-0.026561,67.88,0
284805,172788.0,-0.240440,0.530483,0.702510,0.689799,-0.377961,0.623708,-0.686180,0.679145,0.392087,...,0.265245,0.800049,-0.163298,0.123205,-0.569159,0.546668,0.108821,0.104533,10.00,0
284806,172792.0,-0.533413,-0.189733,0.703337,-0.506271,-0.012546,-0.649617,1.577006,-0.414650,0.486180,...,0.261057,0.643078,0.376777,0.008797,-0.473649,-0.818267,-0.002415,0.013649,217.00,0

In [60]:
df[[col for col in df.columns if col.startswith("V")]]

,V1,V2,V3,V4,V5,V6,V7,V8,V9,V10,...,V19,V20,V21,V22,V23,V24,V25,V26,V27,V28
0,-1.359807,-0.072781,2.536347,1.378155,-0.338321,0.462388,0.239599,0.098698,0.363787,0.090794,...,0.403993,0.251412,-0.018307,0.277838,-0.110474,0.066928,0.128539,-0.189115,0.133558,-0.021053
1,1.191857,0.266151,0.166480,0.448154,0.060018,-0.082361,-0.078803,0.085102,-0.255425,-0.166974,...,-0.145783,-0.069083,-0.225775,-0.638672,0.101288,-0.339846,0.167170,0.125895,-0.008983,0.014724
2,-1.358354,-1.340163,1.773209,0.379780,-0.503198,1.800499,0.791461,0.247676,-1.514654,0.207643,...,-2.261857,0.524980,0.247998,0.771679,0.909412,-0.689281,-0.327642,-0.139097,-0.055353,-0.059752
3,-0.966272,-0.185226,1.792993,-0.863291,-0.010309,1.247203,0.237609,0.377436,-1.387024,-0.054952,...,-1.232622,-0.208038,-0.108300,0.005274,-0.190321,-1.175575,0.647376,-0.221929,0.062723,0.061458
4,-1.158233,0.877737,1.548718,0.403034,-0.407193,0.095921,0.592941,-0.270533,0.817739,0.753074,...,0.803487,0.408542,-0.009431,0.798278,-0.137458,0.141267,-0.206010,0.502292,0.219422,0.215153
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284802,-11.881118,10.071785,-9.834783,-2.066656,-5.364473,-2.606837,-4.918215,7.305334,1.914428,4.356170,...,-0.682920,1.475829,0.213454,0.111864,1.014480,-0.509348,1.436807,0.250034,0.943651,0.823731
284803,-0.732789,-0.055080,2.035030,-0.738589,0.868229,1.058415,0.024330,0.294869,0.584800,-0.975926,...,-1.545556,0.059616,0.214205,0.924384,0.012463,-1.016226,-0.606624,-0.395255,0.068472,-0.053527
284804,1.919565,-0.301254,-3.249640,-0.557828,2.630515,3.031260,-0.296827,0.708417,0.432454,-0.484782,...,-0.577252,0.001396,0.232045,0.578229,-0.037501,0.640134,0.265745,-0.087371,0.004455,-0.026561
284805,-0.240440,0.530483,0.702510,0.689799,-0.377961,0.623708,-0.686180,0.679145,0.392087,-0.399126,...,2.897849,0.127434,0.265245,0.800049,-0.163298,0.123205,-0.569159,0.546668,0.108821,0.104533
284806,-0.533413,-0.189733,0.703337,-0.506271,-0.012546,-0.649617,1.577006,-0.414650,0.486180,-0.915427,...,-0.256117,0.382948,0.261057,0.643078,0.376777,0.008797,-0.473649,-0.818267,-0.002415,0.013649

In [62]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [ ]:
3. Data Selection
df.loc[] – Label-based indexing for rows and columns.
df.iloc[] – Integer-location based indexing for rows and columns.
df.at[] – Access a single value for a given row/column pair (label-based).
df.iat[] – Access a single value for a given row/column pair (integer-based).
df.query() – Query DataFrame with an expression.
df.filter() – Filter DataFrame with column names or regular expressions.
df.head() – Get the first n rows.
df.tail() – Get the last n rows.
df.sample() – Get random samples from the DataFrame.
df.get() – Retrieve a column by name.
df.select_dtypes() – Select columns based on their data type.

In [150]:
df = pd.read_csv("emprecords.csv")

In [151]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [ ]:
df.loc[] – Label-based indexing for rows and columns.
df.iloc[] – Integer-location based indexing for rows and columns.

In [65]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [ ]:
loc -- > label based data selection

In [ ]:
df.loc[row,col]
df.loc[start_row : end_row,start_col:end_col]

In [67]:
df.loc[1:2,"id":"sal"]

    id    name       sal
1  102  madhav    434342
2  103  rakesh  23432432

In [69]:
df.loc[0:1,["id","sal"]]

    id     sal
0  101   54353
1  102  434342

In [70]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [72]:
df.loc[2,"name"] = "Rakesh"

In [74]:
df.loc[[0,3],["id","sal"]]

    id     sal
0  101   54353
3  104  432432

In [75]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  Rakesh  23432432
3  104    amit    432432

In [ ]:
iloc : integer based location

In [78]:
df.iloc[1:3,0:3]

    id    name       sal
1  102  madhav    434342
2  103  Rakesh  23432432

In [ ]:
loc  : label based
      start : end  -end inclusive

iloc: integer based
    start:end  --> end value exclusive

In [81]:
df.iloc[[0,3],0:3]

    id    name     sal
0  101  keshav   54353
3  104    amit  432432

In [ ]:
at -- label based single value
iat -- integer based single value

In [82]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  Rakesh  23432432
3  104    amit    432432

In [85]:
df.at[3,"name"] ="test"

In [84]:
df.iat[3,1]

'amit'

In [86]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  Rakesh  23432432
3  104    test    432432

In [88]:
df.query("sal>60000")

    id    name       sal
1  102  madhav    434342
2  103  Rakesh  23432432
3  104    test    432432

In [91]:
df.query("city=='Whitestad'")

   eid         ename             eemailid       city
0    1  Tamara House  carol99@example.com  Whitestad

In [93]:
df[df['city']=='Whitestad']

   eid         ename             eemailid       city
0    1  Tamara House  carol99@example.com  Whitestad

In [94]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [98]:
df[df['city']=='Gutierrezmouth']

    eid        ename                eemailid            city
2     3  Victor Ryan    joseph88@example.com  Gutierrezmouth
29   30  Greg Romero  smithsarah@example.com  Gutierrezmouth

In [100]:
df[df['city'].isin(["Gutierrezmouth","Whitestad"])]

    eid         ename                eemailid            city
0     1  Tamara House     carol99@example.com       Whitestad
2     3   Victor Ryan    joseph88@example.com  Gutierrezmouth
29   30   Greg Romero  smithsarah@example.com  Gutierrezmouth

In [104]:
df.query("sal>60000 & name=='rakesh'")

    id    name       sal
2  103  rakesh  23432432

In [105]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [110]:
df[df['eemailid'].str.endswith("example.com")]

    eid              ename                       eemailid               city
0     1       Tamara House            carol99@example.com          Whitestad
2     3        Victor Ryan           joseph88@example.com     Gutierrezmouth
4     5     Lori Contreras            msawyer@example.com     North Luisside
5     6       John Escobar     jennifersutton@example.com         Port Laura
7     8     Julie Schaefer             gallen@example.com       Estradaburgh
9    10      Teresa Burton            kylecox@example.com  North Andreahaven
11   12    Jennifer Flores         kristina16@example.com          West Cory
18   19     Susan Mitchell        reidrebecca@example.com          Kevinfurt
20   21    Philip Chandler          calvarado@example.com       Port Melissa
23   24    Ronald Espinoza             gjones@example.com         Davisshire
29   30        Greg Romero         smithsarah@example.com     Gutierrezmouth
30   31     Kristina Zhang         vangsharon@example.com            Fordton
32   33    Angela Phillips           marcus01@example.com     Cassandramouth
34   35       Jason Nelson              zrios@example.com        Charlesfort
36   37        Jared White           steven99@example.com          Boydville
38   39      Jessica Young     cunninghamsara@example.com       Port Richard
39   40   Olivia Hernandez              cbray@example.com            Rosston
41   42  Michelle Robinson        joselambert@example.com  West Michellefurt
45   46       Daniel Wolfe          johnclark@example.com    Port Sarahmouth
46   47        Laura Burke     nicholasashley@example.com    Stephensonshire
47   48    Reginald Harper         hogantonya@example.com      Stephanieland
50   51       Stacey Davis      morganallison@example.com           Huntport
52   53      Laura Jackson         kimberly11@example.com  Port Brittneytown
54   55       Connie Evans         quinnsusan@example.com     North Tinaberg
57   58      Kathy Huffman        millernancy@example.com       Craigborough
60   61      Sarah Johnson         murraysean@example.com        Englishtown
62   63       Ashley Jones             lstone@example.com        Robertburgh
69   70       Tristan Dean      nelsonanthony@example.com     Rodriguezburgh
73   74    Barbara Johnson         pricebilly@example.com          Rogerbury
74   75      April Kennedy             jose40@example.com    Benjaminborough
86   87     Nicholas Evans        savagemegan@example.com      Christinebury
94   95       Natalie Pena       nathannelson@example.com          Leahhaven
97   98        Terry Cohen  gabriellemartinez@example.com         Meghanside

In [ ]:
df.head() – Get the first n rows.
df.tail() – Get the last n rows.
df.sample() – Get random samples from the DataFrame.
df.get() – Retrieve a column by name.
df.select_dtypes() – Select columns based on their data type.

In [113]:
df.head(10)

   eid             ename                    eemailid               city
0    1      Tamara House         carol99@example.com          Whitestad
1    2  Patricia Stevens       hbradford@example.net      East Veronica
2    3       Victor Ryan        joseph88@example.com     Gutierrezmouth
3    4       David Glass  timothyroberts@example.org   East Kristenstad
4    5    Lori Contreras         msawyer@example.com     North Luisside
5    6      John Escobar  jennifersutton@example.com         Port Laura
6    7    Donna Phillips       iwilliams@example.org       Perkinsville
7    8    Julie Schaefer          gallen@example.com       Estradaburgh
8    9       Angela Kane     davidwilson@example.net        Robertmouth
9   10     Teresa Burton         kylecox@example.com  North Andreahaven

In [112]:
df.tail()

    eid               ename                       eemailid               city
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

In [114]:
df.dtypes

eid          int64
ename       object
eemailid    object
city        object
dtype: object

In [116]:
df.select_dtypes("O")

                 ename                       eemailid               city
0         Tamara House            carol99@example.com          Whitestad
1     Patricia Stevens          hbradford@example.net      East Veronica
2          Victor Ryan           joseph88@example.com     Gutierrezmouth
3          David Glass     timothyroberts@example.org   East Kristenstad
4       Lori Contreras            msawyer@example.com     North Luisside
..                 ...                            ...                ...
95          Jill Tapia              fchen@example.org       South Vernon
96        Alexis Smith       timothysmith@example.net        Millerburgh
97         Terry Cohen  gabriellemartinez@example.com         Meghanside
98  Christopher Berger          heather86@example.org  West Lorrainefurt
99        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 3 columns]

In [121]:
df.sample(25)

    eid             ename                  eemailid                 city
9    10     Teresa Burton       kylecox@example.com    North Andreahaven
92   93    Kirsten Willis       wpeters@example.net          New Melissa
27   28    Charles Miller     chenjason@example.org       Port Brianstad
26   27     Dalton Norris  charleslewis@example.net       South Brittany
47   48   Reginald Harper    hogantonya@example.com        Stephanieland
0     1      Tamara House       carol99@example.com            Whitestad
18   19    Susan Mitchell   reidrebecca@example.com            Kevinfurt
19   20    Ryan Brown DVM       jason18@example.org  New Christopherfort
76   77    Russell Miller        rick72@example.net      Lake Tylermouth
65   66     Jane Petersen       megan61@example.org           Pamelatown
59   60    William Moreno     jwhitaker@example.net      East Ronaldtown
14   15          Kyle Lee       ggibson@example.org            Trevorton
54   55      Connie Evans    quinnsusan@example.com       North Tinaberg
8     9       Angela Kane   davidwilson@example.net          Robertmouth
13   14   Catherine Smith     antonio34@example.net           Lopezmouth
52   53     Laura Jackson    kimberly11@example.com    Port Brittneytown
11   12   Jennifer Flores    kristina16@example.com            West Cory
85   86      Heather Reid   kramerdavid@example.org           Brownhaven
80   81     David Francis   craiggamble@example.org            Ryanville
94   95      Natalie Pena  nathannelson@example.com            Leahhaven
64   65      Marcus Boone      rhonda74@example.net         Johnstonstad
21   22    Dr. Karen Cobb       mandy20@example.net          West Ashley
12   13  Morgan Hernandez        mary12@example.org            Jonesbury
51   52     Barbara Perez        sjones@example.net          Charlestown
67   68          Amy West      martin49@example.org            Allenstad

In [ ]:
Testing 
validation

In [123]:
df.sample(15)

    eid             ename                    eemailid               city
78   79     Alex Anderson          nbaker@example.org           Johnland
39   40  Olivia Hernandez           cbray@example.com            Rosston
83   84      Daniel Hines     sandrahobbs@example.org       Williamsside
57   58     Kathy Huffman     millernancy@example.com       Craigborough
80   81     David Francis     craiggamble@example.org          Ryanville
65   66     Jane Petersen         megan61@example.org         Pamelatown
28   29     Ashley Holden   christopher70@example.net         Moorehaven
26   27     Dalton Norris    charleslewis@example.net     South Brittany
64   65      Marcus Boone        rhonda74@example.net       Johnstonstad
32   33   Angela Phillips        marcus01@example.com     Cassandramouth
71   72       Robert Diaz    castrocheryl@example.org     East Wendyfurt
61   62   Christine Mckay         pflores@example.net        Watsonburgh
52   53     Laura Jackson      kimberly11@example.com  Port Brittneytown
24   25     Matthew Nunez         scott52@example.net        Sheltonside
5     6      John Escobar  jennifersutton@example.com         Port Laura

In [124]:
df

    eid               ename                       eemailid               city
0     1        Tamara House            carol99@example.com          Whitestad
1     2    Patricia Stevens          hbradford@example.net      East Veronica
2     3         Victor Ryan           joseph88@example.com     Gutierrezmouth
3     4         David Glass     timothyroberts@example.org   East Kristenstad
4     5      Lori Contreras            msawyer@example.com     North Luisside
..  ...                 ...                            ...                ...
95   96          Jill Tapia              fchen@example.org       South Vernon
96   97        Alexis Smith       timothysmith@example.net        Millerburgh
97   98         Terry Cohen  gabriellemartinez@example.com         Meghanside
98   99  Christopher Berger          heather86@example.org  West Lorrainefurt
99  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[100 rows x 4 columns]

In [125]:
df = pd.read_csv("emprecords.csv")

In [127]:
df['new col'] = 'test'

In [128]:
df

    id    name       sal new col
0  101  keshav     54353    test
1  102  madhav    434342    test
2  103  rakesh  23432432    test
3  104    amit    432432    test

In [129]:
import datetime

In [131]:
df['latest_up']  = datetime.datetime.now()

In [132]:
df

    id    name       sal new col                  latest_up
0  101  keshav     54353    test 2025-11-18 20:59:59.384010
1  102  madhav    434342    test 2025-11-18 20:59:59.384010
2  103  rakesh  23432432    test 2025-11-18 20:59:59.384010
3  104    amit    432432    test 2025-11-18 20:59:59.384010

In [133]:
#How to remove col

In [137]:
final = df.drop("new col",axis=1)

In [138]:
final

    id    name       sal                  latest_up
0  101  keshav     54353 2025-11-18 20:59:59.384010
1  102  madhav    434342 2025-11-18 20:59:59.384010
2  103  rakesh  23432432 2025-11-18 20:59:59.384010
3  104    amit    432432 2025-11-18 20:59:59.384010

In [139]:
final

    id    name       sal                  latest_up
0  101  keshav     54353 2025-11-18 20:59:59.384010
1  102  madhav    434342 2025-11-18 20:59:59.384010
2  103  rakesh  23432432 2025-11-18 20:59:59.384010
3  104    amit    432432 2025-11-18 20:59:59.384010

In [141]:
df.drop("new col",axis=1,inplace=True)

In [142]:
df

    id    name       sal                  latest_up
0  101  keshav     54353 2025-11-18 20:59:59.384010
1  102  madhav    434342 2025-11-18 20:59:59.384010
2  103  rakesh  23432432 2025-11-18 20:59:59.384010
3  104    amit    432432 2025-11-18 20:59:59.384010

In [ ]:
axis =1 --> col 
axis =0 --> row

inplace = False --> new variable store result
inplace = True  --> same variable store result

In [145]:
df.drop([1,3])

    id    name       sal                  latest_up
0  101  keshav     54353 2025-11-18 20:59:59.384010
2  103  rakesh  23432432 2025-11-18 20:59:59.384010

In [148]:
df.drop(columns=["id","latest_up"],inplace=True)

In [149]:
df

     name       sal
0  keshav     54353
1  madhav    434342
2  rakesh  23432432
3    amit    432432

In [ ]:
add col single ,muliple concat
drop col -- single col ,multiple col
row single as well as multiple

In [ ]:
9. String Methods
df.str.contains() – Check if a string contains a substring.
df.str.replace() – Replace substrings in a column.
df.str.upper() – Convert strings to uppercase.
df.str.lower() – Convert strings to lowercase.
df.str.strip() – Remove leading and trailing whitespaces.
df.str.split() – Split strings by a delimiter.
df.str.len() – Get the length of each string.
df.str.findall() – Find all occurrences of a pattern.
df.str.extract() – Extract matched groups from strings.
df.str.slice() – Extract slices from a string.

In [152]:
df = pd.read_csv("employee_records.csv")

In [155]:
df[df['ename'].str.contains("Ry")]

    eid           ename              eemailid                 city
2     3     Victor Ryan  joseph88@example.com       Gutierrezmouth
19   20  Ryan Brown DVM   jason18@example.org  New Christopherfort

In [164]:
df['newemail'] = df['eemailid'].str.replace("@example.com","")

In [165]:
df

,eid,ename,eemailid,city,newemail
0,1,Tamara House,carol99@example.com,Whitestad,carol99
1,2,Patricia Stevens,hbradford@example.net,East Veronica,hbradford@example.net
2,3,Victor Ryan,joseph88@example.com,Gutierrezmouth,joseph88
3,4,David Glass,timothyroberts@example.org,East Kristenstad,timothyroberts@example.org
4,5,Lori Contreras,msawyer@example.com,North Luisside,msawyer
...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,South Vernon,fchen@example.org
96,97,Alexis Smith,timothysmith@example.net,Millerburgh,timothysmith@example.net
97,98,Terry Cohen,gabriellemartinez@example.com,Meghanside,gabriellemartinez
98,99,Christopher Berger,heather86@example.org,West Lorrainefurt,heather86@example.org
99,100,Wendy Turner,clarkchristopher@example.net,West Jeffrey,clarkchristopher@example.net

In [168]:
df['city'] = df['city'].str.upper()

In [169]:
df

,eid,ename,eemailid,city,newemail
0,1,Tamara House,carol99@example.com,WHITESTAD,carol99
1,2,Patricia Stevens,hbradford@example.net,EAST VERONICA,hbradford@example.net
2,3,Victor Ryan,joseph88@example.com,GUTIERREZMOUTH,joseph88
3,4,David Glass,timothyroberts@example.org,EAST KRISTENSTAD,timothyroberts@example.org
4,5,Lori Contreras,msawyer@example.com,NORTH LUISSIDE,msawyer
...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,SOUTH VERNON,fchen@example.org
96,97,Alexis Smith,timothysmith@example.net,MILLERBURGH,timothysmith@example.net
97,98,Terry Cohen,gabriellemartinez@example.com,MEGHANSIDE,gabriellemartinez
98,99,Christopher Berger,heather86@example.org,WEST LORRAINEFURT,heather86@example.org
99,100,Wendy Turner,clarkchristopher@example.net,WEST JEFFREY,clarkchristopher@example.net

In [170]:
df

,eid,ename,eemailid,city,newemail
0,1,Tamara House,carol99@example.com,WHITESTAD,carol99
1,2,Patricia Stevens,hbradford@example.net,EAST VERONICA,hbradford@example.net
2,3,Victor Ryan,joseph88@example.com,GUTIERREZMOUTH,joseph88
3,4,David Glass,timothyroberts@example.org,EAST KRISTENSTAD,timothyroberts@example.org
4,5,Lori Contreras,msawyer@example.com,NORTH LUISSIDE,msawyer
...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,SOUTH VERNON,fchen@example.org
96,97,Alexis Smith,timothysmith@example.net,MILLERBURGH,timothysmith@example.net
97,98,Terry Cohen,gabriellemartinez@example.com,MEGHANSIDE,gabriellemartinez
98,99,Christopher Berger,heather86@example.org,WEST LORRAINEFURT,heather86@example.org
99,100,Wendy Turner,clarkchristopher@example.net,WEST JEFFREY,clarkchristopher@example.net

In [175]:
df['test']= df['eemailid'].str.split('@')

In [176]:
df

,eid,ename,eemailid,city,newemail,test
0,1,Tamara House,carol99@example.com,WHITESTAD,carol99,"[carol99, example.com]"
1,2,Patricia Stevens,hbradford@example.net,EAST VERONICA,hbradford@example.net,"[hbradford, example.net]"
2,3,Victor Ryan,joseph88@example.com,GUTIERREZMOUTH,joseph88,"[joseph88, example.com]"
3,4,David Glass,timothyroberts@example.org,EAST KRISTENSTAD,timothyroberts@example.org,"[timothyroberts, example.org]"
4,5,Lori Contreras,msawyer@example.com,NORTH LUISSIDE,msawyer,"[msawyer, example.com]"
...,...,...,...,...,...,...
95,96,Jill Tapia,fchen@example.org,SOUTH VERNON,fchen@example.org,"[fchen, example.org]"
96,97,Alexis Smith,timothysmith@example.net,MILLERBURGH,timothysmith@example.net,"[timothysmith, example.net]"
97,98,Terry Cohen,gabriellemartinez@example.com,MEGHANSIDE,gabriellemartinez,"[gabriellemartinez, example.com]"
98,99,Christopher Berger,heather86@example.org,WEST LORRAINEFURT,heather86@example.org,"[heather86, example.org]"
99,100,Wendy Turner,clarkchristopher@example.net,WEST JEFFREY,clarkchristopher@example.net,"[clarkchristopher, example.net]"

In [178]:
df['city'].str.len()

0      9
1     13
2     14
3     16
4     14
      ..
95    12
96    11
97    10
98    17
99    12
Name: city, Length: 100, dtype: int64